data/test_tool/templates/login.soap.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:auth="http://example.com/auth">
  <soap:Body>
    <auth:Login>
      <auth:InstitutNr>{{institut}}</auth:InstitutNr>
      <auth:Username>{{user}}</auth:Username>
      <auth:Password>{{password}}</auth:Password>
      <auth:ApplicationId>AI-Assist</auth:ApplicationId>
    </auth:Login>
  </soap:Body>
</soap:Envelope>
